Tekla.Structures.CatalogInternal.ImportFromArchive
The structure for specifying the source of importing a shape from a TS shape archive file.

Tekla.Structures.CatalogInternal.ImportFromArchive.ToStruct
Creates an instance in internal struct.
Returns:
The Tekla.Structures.CatalogInternal.dotcatShapeImport_t.